evidence/adim-10-4/final/k6_origin_100vu_raw.txt

         /\      Grafana   /ÔÇ¥ÔÇ¥/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ÔÇ¥ÔÇ¥\ 
  /          \   |   (  |  (ÔÇ¥)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: evidence\adim-10-4\k6\load_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 47s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 17s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (01.0s), 020/100 VUs, 16 complete and 0 interrupted iterations
default   [   6% ] 020/100 VUs  01.0s/17.0s

running (02.0s), 040/100 VUs, 61 complete and 0 interrupted iterations
default   [  12% ] 040/100 VUs  02.0s/17.0s

running (03.0s), 059/100 VUs, 118 complete and 0 interrupted iterations
default   [  18% ] 059/100 VUs  03.0s/17.0s

running (04.0s), 079/100 VUs, 172 complete and 0 interrupted iterations
default   [  23% ] 079/100 VUs  04.0s/17.0s

running (05.0s), 099/100 VUs, 199 complete and 0 interrupted iterations
default   [  29% ] 099/100 VUs  05.0s/17.0s

running (06.0s), 100/100 VUs, 291 complete and 0 interrupted iterations
default   [  35% ] 100/100 VUs  06.0s/17.0s

running (07.0s), 100/100 VUs, 296 complete and 0 interrupted iterations
default   [  41% ] 100/100 VUs  07.0s/17.0s

running (08.0s), 100/100 VUs, 387 complete and 0 interrupted iterations
default   [  47% ] 100/100 VUs  08.0s/17.0s

running (09.0s), 100/100 VUs, 418 complete and 0 interrupted iterations
default   [  53% ] 100/100 VUs  09.0s/17.0s

running (10.0s), 100/100 VUs, 518 complete and 0 interrupted iterations
default   [  59% ] 100/100 VUs  10.0s/17.0s

running (11.0s), 100/100 VUs, 591 complete and 0 interrupted iterations
default   [  65% ] 100/100 VUs  11.0s/17.0s

running (12.0s), 100/100 VUs, 619 complete and 0 interrupted iterations
default   [  70% ] 100/100 VUs  12.0s/17.0s

running (13.0s), 100/100 VUs, 646 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  13.0s/17.0s

running (14.0s), 100/100 VUs, 733 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  14.0s/17.0s

running (15.0s), 100/100 VUs, 816 complete and 0 interrupted iterations
default   [  88% ] 100/100 VUs  15.0s/17.0s

running (16.0s), 095/100 VUs, 854 complete and 0 interrupted iterations
default   [  94% ] 095/100 VUs  16.0s/17.0s

running (17.0s), 027/100 VUs, 952 complete and 0 interrupted iterations
default   [ 100% ] 027/100 VUs  17.0s/17.0s

     Ô£ô status is 200 or 401

     checks.........................: 100.00% 979 out of 979
     data_received..................: 135 MB  7.8 MB/s
     data_sent......................: 407 kB  23 kB/s
     http_req_blocked...............: avg=43.9ms   min=0s       med=0s       max=1.76s    p(90)=64.4ms   p(95)=254.17ms
     http_req_connecting............: avg=8.31ms   min=0s       med=0s       max=1.05s    p(90)=23.71ms  p(95)=46.95ms 
     http_req_duration..............: avg=1.28s    min=178.89ms med=1.37s    max=4.3s     p(90)=1.95s    p(95)=2.15s   
       { expected_response:true }...: avg=1.28s    min=178.89ms med=1.37s    max=4.3s     p(90)=1.95s    p(95)=2.15s   
   Ô£ô http_req_failed................: 0.00%   0 out of 979
     http_req_receiving.............: avg=875.16ms min=2.09ms   med=935.61ms max=3.66s    p(90)=1.43s    p(95)=1.61s   
     http_req_sending...............: avg=1.29ms   min=0s       med=0s       max=597.48ms p(90)=1.04ms   p(95)=2.69ms  
     http_req_tls_handshaking.......: avg=35.47ms  min=0s       med=0s       max=1.65s    p(90)=37.68ms  p(95)=152.6ms 
     http_req_waiting...............: avg=413.38ms min=128.82ms med=368.3ms  max=1.19s    p(90)=729.79ms p(95)=814.62ms
     http_reqs......................: 979     56.340658/s
     iteration_duration.............: avg=1.43s    min=279.97ms med=1.48s    max=4.94s    p(90)=2.13s    p(95)=2.41s   
     iterations.....................: 979     56.340658/s
     vus............................: 27      min=20         max=100
     vus_max........................: 100     min=100        max=100


running (17.4s), 000/100 VUs, 979 complete and 0 interrupted iterations
default Ô£ô [ 100% ] 000/100 VUs  17s