evidence/adim-10-4/final/k6_origin_50vu_raw.txt

         /\      Grafana   /ÔÇ¥ÔÇ¥/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ÔÇ¥ÔÇ¥\ 
  /          \   |   (  |  (ÔÇ¥)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: evidence\adim-10-4\k6\load_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 47s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 17s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (01.0s), 10/50 VUs, 9 complete and 0 interrupted iterations
default   [   6% ] 10/50 VUs  01.0s/17.0s

running (02.0s), 20/50 VUs, 47 complete and 0 interrupted iterations
default   [  12% ] 20/50 VUs  02.0s/17.0s

running (03.0s), 30/50 VUs, 104 complete and 0 interrupted iterations
default   [  18% ] 30/50 VUs  03.0s/17.0s

running (04.0s), 40/50 VUs, 149 complete and 0 interrupted iterations
default   [  23% ] 40/50 VUs  04.0s/17.0s

running (05.0s), 49/50 VUs, 227 complete and 0 interrupted iterations
default   [  29% ] 49/50 VUs  05.0s/17.0s

running (06.0s), 50/50 VUs, 292 complete and 0 interrupted iterations
default   [  35% ] 50/50 VUs  06.0s/17.0s

running (07.0s), 50/50 VUs, 340 complete and 0 interrupted iterations
default   [  41% ] 50/50 VUs  07.0s/17.0s

running (08.1s), 50/50 VUs, 359 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  08.1s/17.0s

running (09.0s), 50/50 VUs, 435 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  09.0s/17.0s

running (10.0s), 50/50 VUs, 506 complete and 0 interrupted iterations
default   [  59% ] 50/50 VUs  10.0s/17.0s

running (11.0s), 50/50 VUs, 553 complete and 0 interrupted iterations
default   [  65% ] 50/50 VUs  11.0s/17.0s

running (12.0s), 50/50 VUs, 615 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  12.0s/17.0s

running (13.0s), 50/50 VUs, 680 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  13.0s/17.0s

running (14.0s), 50/50 VUs, 733 complete and 0 interrupted iterations
default   [  82% ] 50/50 VUs  14.0s/17.0s

running (15.0s), 50/50 VUs, 790 complete and 0 interrupted iterations
default   [  88% ] 50/50 VUs  15.0s/17.0s

running (16.0s), 39/50 VUs, 844 complete and 0 interrupted iterations
default   [  94% ] 39/50 VUs  16.0s/17.0s

running (17.0s), 08/50 VUs, 898 complete and 0 interrupted iterations
default   [ 100% ] 08/50 VUs  17.0s/17.0s

     Ô£ô status is 200 or 401

     checks.........................: 100.00% 906 out of 906
     data_received..................: 125 MB  7.2 MB/s
     data_sent......................: 355 kB  20 kB/s
     http_req_blocked...............: avg=10.86ms  min=0s       med=0s       max=1.37s    p(90)=0s       p(95)=72.22ms 
     http_req_connecting............: avg=2.96ms   min=0s       med=0s       max=244.62ms p(90)=0s       p(95)=24.68ms 
     http_req_duration..............: avg=648.06ms min=163.89ms med=675.12ms max=1.51s    p(90)=979.22ms p(95)=1.04s   
       { expected_response:true }...: avg=648.06ms min=163.89ms med=675.12ms max=1.51s    p(90)=979.22ms p(95)=1.04s   
   Ô£ô http_req_failed................: 0.00%   0 out of 906
     http_req_receiving.............: avg=386.78ms min=6.54ms   med=406.33ms max=1.3s     p(90)=689.37ms p(95)=764.03ms
     http_req_sending...............: avg=1.12ms   min=0s       med=0s       max=258.42ms p(90)=1.34ms   p(95)=2.68ms  
     http_req_tls_handshaking.......: avg=7.52ms   min=0s       med=0s       max=1.21s    p(90)=0s       p(95)=42.56ms 
     http_req_waiting...............: avg=260.16ms min=143.97ms med=244.55ms max=599.63ms p(90)=366.35ms p(95)=412.42ms
     http_reqs......................: 906     52.195999/s
     iteration_duration.............: avg=764.99ms min=264.85ms med=787.52ms max=2.27s    p(90)=1.1s     p(95)=1.18s   
     iterations.....................: 906     52.195999/s
     vus............................: 8       min=8          max=50
     vus_max........................: 50      min=50         max=50


running (17.4s), 00/50 VUs, 906 complete and 0 interrupted iterations
default Ô£ô [ 100% ] 00/50 VUs  17s